subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/m0p/mspm0c511x.h
/******************************************************************************
* Processor and Core Peripheral Section                                       *
******************************************************************************/

#define __CM0PLUS_REV           0x0001U       /* Core revision */
#define __MPU_PRESENT           0x0001U       /* MPU present */
#define __VTOR_PRESENT          0x0001U       /* VTOR present */
#define __NVIC_PRIO_BITS        0x0002U       /* Number of bits used for Priority Levels */
#define __Vendor_SysTickConfig  0x0000U       /* Set to 1 if different SysTick Config is used */

#include "core_cm0plus.h"                  /* Processor and core peripherals */

/******************************************************************************
* Peripheral headers                                                          *
******************************************************************************/
/** @addtogroup MSPM0G511X_Peripherals MSPM0G511X Peripherals
  MSPM0G511X Peripheral registers structures
  @{
*/

#include <ti/devices/msp/peripherals/hw_adc12.h>
#include <ti/devices/msp/peripherals/hw_btimer.h>
#include <ti/devices/msp/peripherals/hw_crc.h>
#include <ti/devices/msp/peripherals/hw_dma.h>
#include <ti/devices/msp/peripherals/hw_flashctl.h>
#include <ti/devices/msp/peripherals/hw_gpio.h>
#include <ti/devices/msp/peripherals/hw_gptimer.h>
#include <ti/devices/msp/peripherals/hw_iomux.h>
#include <ti/devices/msp/peripherals/hw_lfss.h>
#include <ti/devices/msp/peripherals/hw_rtc.h>
#include <ti/devices/msp/peripherals/hw_spgss.h>
#include <ti/devices/msp/peripherals/hw_unicomm.h>
#include <ti/devices/msp/peripherals/hw_unicommi2cc.h>
#include <ti/devices/msp/peripherals/hw_unicommi2ct.h>
#include <ti/devices/msp/peripherals/hw_unicommspi.h>
#include <ti/devices/msp/peripherals/hw_unicommuart.h>
#include <ti/devices/msp/peripherals/hw_usblc.h>
#include <ti/devices/msp/peripherals/hw_vref.h>
#include <ti/devices/msp/peripherals/hw_wuc.h>
#include <ti/devices/msp/peripherals/hw_wwdt.h>
#include <ti/devices/msp/peripherals/m0p/hw_cpuss.h>
#include <ti/devices/msp/peripherals/m0p/hw_debugss.h>
#include <ti/devices/msp/peripherals/m0p/hw_sysctl.h>
#include <ti/devices/msp/peripherals/m0p/hw_factoryregion.h>

#define __MSPM0_HAS_ADC12__
#define __MSPM0_HAS_CRC__
#define __MSPM0_HAS_GPIO__
#define __MSPM0_HAS_TIMER_A__
#define __MSPM0_HAS_TIMER_G__
#define __MSPM0_HAS_BTIMER__
#define __MSPM0_HAS_LFSS__
#define __MSPM0_HAS_RTC_B__
#define __MSPM0_HAS_IWDT__
#define __MSPM0_HAS_VREF__
#define __MSPM0_HAS_WWDT__

#define __MCU_HAS_SPGSS__
#define __MCU_HAS_UNICOMM__
#define __MCU_HAS_UNICOMMUART__
#define __MCU_HAS_UNICOMMI2CC__
#define __MCU_HAS_UNICOMMI2CT__
#define __MCU_HAS_UNICOMMSPI__
#define __MCU_HAS_USBLC__

/*@}*/ /* end of group MSPM0G511X_Peripherals */

/******************************************************************************
* Device and peripheral memory map                                            *
******************************************************************************/
/** @addtogroup MSPM0G511X_MemoryMap MSPM0G511X Memory Mapping
  @{
*/

#define ADC0_BASE                      (0x40004000U)     /*!< Base address of module ADC0 */
#define VREF_BASE                      (0x40030000U)     /*!< Base address of module VREF */
#define WWDT0_BASE                     (0x40080000U)     /*!< Base address of module WWDT0 */
#define TIMG0_BASE                     (0x40084000U)     /*!< Base address of module TIMG0 */
#define LFSS_BASE                      (0x40094000U)     /*!< Base address of module LFSS */
#define RTC_B_BASE                     (0x40094000U)     /*!< Base address of module RTC_B */
#define IWDT_BASE                      (0x40094000U)     /*!< Base address of module IWDT */
#define GPIOA_BASE                     (0x400A0000U)     /*!< Base address of module GPIOA */
#define GPIOB_BASE                     (0x400A2000U)     /*!< Base address of module GPIOB */
#define SYSCTL_BASE                    (0x400AF000U)     /*!< Base address of module SYSCTL */
#define TIMB0_BASE                     (0x400B8000U)     /*!< Base address of module TIMB0 */
#define DEBUGSS_BASE                   (0x400C7000U)     /*!< Base address of module DEBUGSS */
#define EVENTLP_BASE                   (0x400C9000U)     /*!< Base address of module EVENTLP */
#define FLASHCTL_BASE                  (0x400CD000U)     /*!< Base address of module FLASHCTL */
#define CPUSS_BASE                     (0x40400000U)     /*!< Base address of module CPUSS */
#define WUC_BASE                       (0x40424000U)     /*!< Base address of module WUC */
#define IOMUX_BASE                     (0x40428000U)     /*!< Base address of module IOMUX */
#define DMA_BASE                       (0x4042A000U)     /*!< Base address of module DMA */
#define CRC0_BASE                      (0x40440000U)     /*!< Base address of module CRC0 */
#define USBLC0_BASE                    (0x4047F000U)     /*!< Base address of module USBLC0 */
#define ADC0_SVT_BASE                  (0x4055A000U)     /*!< Base address of module ADC0_SVT */
#define TIMG6_BASE                     (0x40868000U)     /*!< Base address of module TIMG6 */
#define TIMG7_BASE                     (0x4086A000U)     /*!< Base address of module TIMG7 */
#define UC0_UART_BASE                  (0x40A00000U)     /*!< Base address of module UC0_UART */
#define UC1_UART_BASE                  (0x40A02000U)     /*!< Base address of module UC1_UART */
#define UC0_I2CC_BASE                  (0x40A20000U)     /*!< Base address of module UC0_I2CC */
#define UC1_I2CC_BASE                  (0x40A22000U)     /*!< Base address of module UC1_I2CC */
#define UC0_I2CT_BASE                  (0x40A40000U)     /*!< Base address of module UC0_I2CT */
#define UC1_I2CT_BASE                  (0x40A42000U)     /*!< Base address of module UC1_I2CT */
#define UC0_BASE                       (0x40A80000U)     /*!< Base address of module UC0 */
#define UC1_BASE                       (0x40A82000U)     /*!< Base address of module UC1 */
#define SPG0_BASE                      (0x40A9F000U)     /*!< Base address of module SPG0 */
#define UC3_UART_BASE                  (0x40B02000U)     /*!< Base address of module UC3_UART */
#define UC2_SPI_BASE                   (0x40B60000U)     /*!< Base address of module UC2_SPI */
#define UC3_SPI_BASE                   (0x40B62000U)     /*!< Base address of module UC3_SPI */
#define UC2_BASE                       (0x40B80000U)     /*!< Base address of module UC2 */
#define UC3_BASE                       (0x40B82000U)     /*!< Base address of module UC3 */
#define SPG1_BASE                      (0x40B9F000U)     /*!< Base address of module SPG1 */
#define FACTORYREGION_BASE             (0x41C40000U)     /*!< Base address of module FACTORYREGION */


