subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/m0p/mspm0c511x.h
typedef struct {
    UNICOMM_Regs         * const inst;
    UNICOMMUART_Regs     * const uart;
    UNICOMMI2CC_Regs     * const i2cc;
    UNICOMMI2CT_Regs     * const i2ct;
    UNICOMMSPI_Regs      * const spi;
    bool                   const fixedMode;
} UNICOMM_Inst_Regs;

static const UNICOMM_Inst_Regs UC0_Inst = {
    .inst      = (UNICOMM_Regs *) UC0_BASE,
    .uart      = (UNICOMMUART_Regs *) UC0_UART_BASE,
    .i2cc      = (UNICOMMI2CC_Regs *) UC0_I2CC_BASE,
    .i2ct      = (UNICOMMI2CT_Regs *) UC0_I2CT_BASE,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC1_Inst = {
    .inst      = (UNICOMM_Regs *) UC1_BASE,
    .uart      = (UNICOMMUART_Regs *) UC1_UART_BASE,
    .i2cc      = (UNICOMMI2CC_Regs *) UC1_I2CC_BASE,
    .i2ct      = (UNICOMMI2CT_Regs *) UC1_I2CT_BASE,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC2_Inst = {
    .inst      = (UNICOMM_Regs *) UC2_BASE,
    .spi       = (UNICOMMSPI_Regs *) UC2_SPI_BASE,
    .fixedMode = true
};
static const UNICOMM_Inst_Regs UC3_Inst = {
    .inst      = (UNICOMM_Regs *) UC3_BASE,
    .uart      = (UNICOMMUART_Regs *) UC3_UART_BASE,
    .spi       = (UNICOMMSPI_Regs *) UC3_SPI_BASE,
};

/*@}*/ /* end of group MSPM0G511X_MemoryMap */

/******************************************************************************
* Peripheral declarations                                                     *
******************************************************************************/
/** @addtogroup MSPM0G511X_PeripheralDecl MSPM0G511X Peripheral Declaration
  @{
*/

static ADC12_Regs                               * const ADC0                           = ((ADC12_Regs *) ADC0_BASE);
static VREF_Regs                                * const VREF                           = ((VREF_Regs *) VREF_BASE);
static WWDT_Regs                                * const WWDT0                          = ((WWDT_Regs *) WWDT0_BASE);
static GPTIMER_Regs                             * const TIMG0                          = ((GPTIMER_Regs *) TIMG0_BASE);
static LFSS_Regs                                * const LFSS                           = ((LFSS_Regs *) LFSS_BASE);
static LFSS_Regs                                * const RTC_B                          = ((LFSS_Regs *) RTC_B_BASE);
static LFSS_Regs                                * const IWDT                           = ((LFSS_Regs *) IWDT_BASE);
static GPIO_Regs                                * const GPIOA                          = ((GPIO_Regs *) GPIOA_BASE);
static GPIO_Regs                                * const GPIOB                          = ((GPIO_Regs *) GPIOB_BASE);
static SYSCTL_Regs                              * const SYSCTL                         = ((SYSCTL_Regs *) SYSCTL_BASE);
static BTIMER_Regs                              * const TIMB0                          = ((BTIMER_Regs *) TIMB0_BASE);
static DEBUGSS_Regs                             * const DEBUGSS                        = ((DEBUGSS_Regs *) DEBUGSS_BASE);
static FLASHCTL_Regs                            * const FLASHCTL                       = ((FLASHCTL_Regs *) FLASHCTL_BASE);
static CPUSS_Regs                               * const CPUSS                          = ((CPUSS_Regs *) CPUSS_BASE);
static WUC_Regs                                 * const WUC                            = ((WUC_Regs *) WUC_BASE);
static IOMUX_Regs                               * const IOMUX                          = ((IOMUX_Regs *) IOMUX_BASE);
static DMA_Regs                                 * const DMA                            = ((DMA_Regs *) DMA_BASE);
static CRC_Regs                                 * const CRC0                           = ((CRC_Regs *) CRC0_BASE);
static USBLC_Regs                               * const USBLC0                         = ((USBLC_Regs *) USBLC0_BASE);
static ADC12_PERIPHERALREGIONSVT_Regs           * const ADC0_SVT                       = ((ADC12_PERIPHERALREGIONSVT_Regs *) ADC0_SVT_BASE);
static GPTIMER_Regs                             * const TIMG6                          = ((GPTIMER_Regs *) TIMG6_BASE);
static GPTIMER_Regs                             * const TIMG7                          = ((GPTIMER_Regs *) TIMG7_BASE);
static UNICOMMUART_Regs                         * const UC0_UART                       = ((UNICOMMUART_Regs *) UC0_UART_BASE);
static UNICOMMUART_Regs                         * const UC1_UART                       = ((UNICOMMUART_Regs *) UC1_UART_BASE);
static UNICOMMI2CC_Regs                         * const UC0_I2CC                       = ((UNICOMMI2CC_Regs *) UC0_I2CC_BASE);
static UNICOMMI2CC_Regs                         * const UC1_I2CC                       = ((UNICOMMI2CC_Regs *) UC1_I2CC_BASE);
static UNICOMMI2CT_Regs                         * const UC0_I2CT                       = ((UNICOMMI2CT_Regs *) UC0_I2CT_BASE);
static UNICOMMI2CT_Regs                         * const UC1_I2CT                       = ((UNICOMMI2CT_Regs *) UC1_I2CT_BASE);
static UNICOMM_Inst_Regs                        * const UC0                            = ((UNICOMM_Inst_Regs *) &UC0_Inst);
static UNICOMM_Inst_Regs                        * const UC1                            = ((UNICOMM_Inst_Regs *) &UC1_Inst);
static SPGSS_Regs                               * const SPG0                           = ((SPGSS_Regs *) SPG0_BASE);
static UNICOMMUART_Regs                         * const UC3_UART                       = ((UNICOMMUART_Regs *) UC3_UART_BASE);
static UNICOMMSPI_Regs                          * const UC2_SPI                        = ((UNICOMMSPI_Regs *) UC2_SPI_BASE);
static UNICOMMSPI_Regs                          * const UC3_SPI                        = ((UNICOMMSPI_Regs *) UC3_SPI_BASE);
static UNICOMM_Inst_Regs                        * const UC2                            = ((UNICOMM_Inst_Regs *) &UC2_Inst);
static UNICOMM_Inst_Regs                        * const UC3                            = ((UNICOMM_Inst_Regs *) &UC3_Inst);
static SPGSS_Regs                               * const SPG1                           = ((SPGSS_Regs *) SPG1_BASE);
static FACTORYREGION_OPEN_Regs                  * const FACTORYREGION                  = ((FACTORYREGION_OPEN_Regs *) FACTORYREGION_BASE);

