subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/m0p/mspm0c511x.h
/* IOMUX_PINCM7[PF] Bits */
#define IOMUX_PINCM7_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM7_PF_GPIOA_DIO04                   ((uint32_t)0X00000001)
#define IOMUX_PINCM7_PF_UC1_SCL                       ((uint32_t)0X00000002)
#define IOMUX_PINCM7_PF_UC1_RX                        ((uint32_t)0X00000002)
#define IOMUX_PINCM7_PF_UC2_POCI                      ((uint32_t)0X00000003)
#define IOMUX_PINCM7_PF_UC2_CS0                       ((uint32_t)0X00000004)
#define IOMUX_PINCM7_PF_TIMG7_CCP1                    ((uint32_t)0X00000005)
#define IOMUX_PINCM7_PF_SYSCTL_LFCLKIN                ((uint32_t)0X00000006)

/* IOMUX_PINCM8[PF] Bits */
#define IOMUX_PINCM8_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM8_PF_GPIOA_DIO05                   ((uint32_t)0X00000001)
#define IOMUX_PINCM8_PF_UC1_SDA                       ((uint32_t)0X00000002)
#define IOMUX_PINCM8_PF_UC1_TX                        ((uint32_t)0X00000002)
#define IOMUX_PINCM8_PF_UC2_PICO                      ((uint32_t)0X00000003)
#define IOMUX_PINCM8_PF_UC0_CTS                       ((uint32_t)0X00000004)
#define IOMUX_PINCM8_PF_TIMG0_CCP0                    ((uint32_t)0X00000005)
#define IOMUX_PINCM8_PF_SYSCTL_FCC_IN                 ((uint32_t)0X00000006)
#define IOMUX_PINCM8_PF_TIMG6_CCP0                    ((uint32_t)0X00000007)
#define IOMUX_PINCM8_PF_UC3_POCI                      ((uint32_t)0X00000008)
#define IOMUX_PINCM8_PF_UC3_RTS                       ((uint32_t)0X00000008)

/* IOMUX_PINCM9[PF] Bits */
#define IOMUX_PINCM9_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM9_PF_GPIOA_DIO06                   ((uint32_t)0X00000001)
#define IOMUX_PINCM9_PF_UC1_SCL                       ((uint32_t)0X00000002)
#define IOMUX_PINCM9_PF_UC1_RX                        ((uint32_t)0X00000002)
#define IOMUX_PINCM9_PF_UC2_SCLK                      ((uint32_t)0X00000003)
#define IOMUX_PINCM9_PF_UC0_RTS                       ((uint32_t)0X00000004)
#define IOMUX_PINCM9_PF_TIMG0_CCP1                    ((uint32_t)0X00000005)
#define IOMUX_PINCM9_PF_SYSCTL_HFCLKIN                ((uint32_t)0X00000006)
#define IOMUX_PINCM9_PF_TIMG6_CCP1                    ((uint32_t)0X00000007)
#define IOMUX_PINCM9_PF_UC3_PICO                      ((uint32_t)0X00000008)
#define IOMUX_PINCM9_PF_UC3_TX                        ((uint32_t)0X00000008)

/* IOMUX_PINCM10[PF] Bits */
#define IOMUX_PINCM10_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM10_PF_GPIOA_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM10_PF_UC2_POCI                     ((uint32_t)0X00000002)
#define IOMUX_PINCM10_PF_UC2_CS2                      ((uint32_t)0X00000003)
#define IOMUX_PINCM10_PF_TIMG7_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM10_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000006)
#define IOMUX_PINCM10_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000007)

/* IOMUX_PINCM11[PF] Bits */
#define IOMUX_PINCM11_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM11_PF_GPIOB_DIO02                  ((uint32_t)0X00000001)
#define IOMUX_PINCM11_PF_UC3_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM11_PF_UC3_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM11_PF_UC1_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM11_PF_UC1_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM11_PF_UC1_CTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM11_PF_TIMG6_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM11_PF_SYSCTL_HFCLKIN               ((uint32_t)0X00000006)
#define IOMUX_PINCM11_PF_UC2_PICO                     ((uint32_t)0X00000007)

/* IOMUX_PINCM12[PF] Bits */
#define IOMUX_PINCM12_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM12_PF_GPIOB_DIO03                  ((uint32_t)0X00000001)
#define IOMUX_PINCM12_PF_UC3_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM12_PF_UC3_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM12_PF_UC1_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM12_PF_UC1_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM12_PF_UC1_RTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM12_PF_TIMG6_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM12_PF_UC2_SCLK                     ((uint32_t)0X00000007)

/* IOMUX_PINCM13[PF] Bits */
#define IOMUX_PINCM13_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM13_PF_GPIOA_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM13_PF_UC1_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM13_PF_UC1_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM13_PF_UC2_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM13_PF_UC0_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM13_PF_UC0_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM13_PF_SYSCTL_HFCLKIN               ((uint32_t)0X00000006)
#define IOMUX_PINCM13_PF_UC2_CS3                      ((uint32_t)0X00000007)
#define IOMUX_PINCM13_PF_UC0_RTS                      ((uint32_t)0X00000008)

/* IOMUX_PINCM14[PF] Bits */
#define IOMUX_PINCM14_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM14_PF_GPIOA_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM14_PF_UC1_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM14_PF_UC1_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM14_PF_UC2_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM14_PF_UC0_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM14_PF_UC0_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM14_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM14_PF_UC3_SCLK                     ((uint32_t)0X00000007)
#define IOMUX_PINCM14_PF_UC3_RX                       ((uint32_t)0X00000007)
#define IOMUX_PINCM14_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000008)
#define IOMUX_PINCM14_PF_UC0_CTS                      ((uint32_t)0X00000009)

/* IOMUX_PINCM15[PF] Bits */
#define IOMUX_PINCM15_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM15_PF_GPIOA_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM15_PF_UC0_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM15_PF_UC0_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM15_PF_UC2_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM15_PF_UC1_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM15_PF_UC1_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM15_PF_TIMG0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM15_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM15_PF_UC3_PICO                     ((uint32_t)0X00000007)
#define IOMUX_PINCM15_PF_UC3_TX                       ((uint32_t)0X00000007)

/* IOMUX_PINCM16[PF] Bits */
#define IOMUX_PINCM16_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM16_PF_GPIOA_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM16_PF_UC0_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM16_PF_UC0_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM16_PF_UC2_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM16_PF_UC1_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM16_PF_UC1_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM16_PF_TIMG0_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM16_PF_UC3_POCI                     ((uint32_t)0X00000007)
#define IOMUX_PINCM16_PF_UC3_RTS                      ((uint32_t)0X00000007)

/* IOMUX_PINCM17[PF] Bits */
#define IOMUX_PINCM17_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM17_PF_GPIOB_DIO06                  ((uint32_t)0X00000001)
#define IOMUX_PINCM17_PF_UC1_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM17_PF_UC1_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM17_PF_UC3_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM17_PF_UC3_CTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM17_PF_UC2_CS1                      ((uint32_t)0X00000004)
#define IOMUX_PINCM17_PF_TIMG6_CCP0                   ((uint32_t)0X00000005)

/* IOMUX_PINCM18[PF] Bits */
#define IOMUX_PINCM18_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM18_PF_GPIOB_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM18_PF_UC1_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM18_PF_UC1_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM18_PF_UC3_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM18_PF_UC3_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM18_PF_UC2_CS2                      ((uint32_t)0X00000004)
#define IOMUX_PINCM18_PF_TIMG6_CCP1                   ((uint32_t)0X00000005)

/* IOMUX_PINCM19[PF] Bits */
#define IOMUX_PINCM19_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM19_PF_GPIOB_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM19_PF_UC1_CTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM19_PF_UC3_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM19_PF_UC3_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM19_PF_UC2_CS0                      ((uint32_t)0X00000004)
#define IOMUX_PINCM19_PF_TIMG7_CCP0                   ((uint32_t)0X00000005)

/* IOMUX_PINCM20[PF] Bits */
#define IOMUX_PINCM20_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM20_PF_GPIOB_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM20_PF_UC1_RTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM20_PF_UC3_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM20_PF_UC3_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM20_PF_UC2_CS3                      ((uint32_t)0X00000004)
#define IOMUX_PINCM20_PF_TIMG7_CCP1                   ((uint32_t)0X00000005)

