subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/m0p/mspm0c511x.h
/* IOMUX_PINCM32[PF] Bits */
#define IOMUX_PINCM32_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM32_PF_GPIOA_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM32_PF_DEBUGSS_SWCLK                ((uint32_t)0X00000002)
#define IOMUX_PINCM32_PF_UC3_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM32_PF_UC3_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM32_PF_UC1_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM32_PF_UC1_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM32_PF_TIMG0_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM32_PF_UC3_CS0                      ((uint32_t)0X00000007)
#define IOMUX_PINCM32_PF_UC3_CTS                      ((uint32_t)0X00000007)

/* IOMUX_PINCM33[PF] Bits */
#define IOMUX_PINCM33_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM33_PF_GPIOB_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM33_PF_UC0_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM33_PF_UC0_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM33_PF_UC2_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM33_PF_TIMG0_CCP0                   ((uint32_t)0X00000005)

/* IOMUX_PINCM34[PF] Bits */
#define IOMUX_PINCM34_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM34_PF_GPIOB_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM34_PF_UC0_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM34_PF_UC0_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM34_PF_UC2_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM34_PF_TIMG0_CCP1                   ((uint32_t)0X00000005)

/* IOMUX_PINCM35[PF] Bits */
#define IOMUX_PINCM35_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM35_PF_GPIOB_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM35_PF_UC0_CTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM35_PF_UC2_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM35_PF_TIMG7_CCP1                   ((uint32_t)0X00000005)

/* IOMUX_PINCM36[PF] Bits */
#define IOMUX_PINCM36_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM36_PF_GPIOA_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM36_PF_UC3_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM36_PF_UC3_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM36_PF_UC2_CS3                      ((uint32_t)0X00000003)
#define IOMUX_PINCM36_PF_UC1_CTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM36_PF_TIMG6_CCP0                   ((uint32_t)0X00000005)

/* IOMUX_PINCM37[PF] Bits */
#define IOMUX_PINCM37_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM37_PF_GPIOA_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM37_PF_UC3_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM37_PF_UC3_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM37_PF_UC2_CS2                      ((uint32_t)0X00000003)
#define IOMUX_PINCM37_PF_UC1_RTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM37_PF_TIMG6_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM37_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)

/* IOMUX_PINCM38[PF] Bits */
#define IOMUX_PINCM38_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM38_PF_GPIOB_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM38_PF_UC0_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM38_PF_UC0_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM38_PF_UC3_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM38_PF_UC3_CTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM38_PF_UC2_CS2                      ((uint32_t)0X00000004)

/* IOMUX_PINCM39[PF] Bits */
#define IOMUX_PINCM39_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM39_PF_GPIOB_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM39_PF_UC2_CS3                      ((uint32_t)0X00000002)
#define IOMUX_PINCM39_PF_UC2_CS1                      ((uint32_t)0X00000003)
#define IOMUX_PINCM39_PF_UC3_POCI                     ((uint32_t)0X00000004)
#define IOMUX_PINCM39_PF_UC3_RTS                      ((uint32_t)0X00000004)

/* IOMUX_PINCM40[PF] Bits */
#define IOMUX_PINCM40_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM40_PF_GPIOA_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM40_PF_UC3_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM40_PF_UC3_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM40_PF_UC2_CS3                      ((uint32_t)0X00000003)
#define IOMUX_PINCM40_PF_UC3_CS0                      ((uint32_t)0X00000004)
#define IOMUX_PINCM40_PF_UC3_CTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM40_PF_TIMG0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM40_PF_TIMG7_CCP0                   ((uint32_t)0X00000007)

/* IOMUX_PINCM41[PF] Bits */
#define IOMUX_PINCM41_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM41_PF_GPIOA_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM41_PF_UC3_POCI                     ((uint32_t)0X00000002)
#define IOMUX_PINCM41_PF_UC3_RTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM41_PF_UC2_CS2                      ((uint32_t)0X00000003)
#define IOMUX_PINCM41_PF_UC3_SCLK                     ((uint32_t)0X00000004)
#define IOMUX_PINCM41_PF_UC3_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM41_PF_TIMG0_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM41_PF_TIMG7_CCP1                   ((uint32_t)0X00000007)

/* IOMUX_PINCM42[PF] Bits */
#define IOMUX_PINCM42_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM42_PF_GPIOA_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM42_PF_UC3_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM42_PF_UC3_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM42_PF_UC2_CS3                      ((uint32_t)0X00000003)
#define IOMUX_PINCM42_PF_UC3_PICO                     ((uint32_t)0X00000004)
#define IOMUX_PINCM42_PF_UC3_TX                       ((uint32_t)0X00000004)

/* IOMUX_PINCM43[PF] Bits */
#define IOMUX_PINCM43_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM43_PF_GPIOA_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM43_PF_UC0_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM43_PF_UC0_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM43_PF_UC1_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM43_PF_UC1_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM43_PF_UC3_PICO                     ((uint32_t)0X00000004)
#define IOMUX_PINCM43_PF_UC3_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM43_PF_TIMG7_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM43_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000006)

/* IOMUX_PINCM44[PF] Bits */
#define IOMUX_PINCM44_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM44_PF_GPIOA_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM44_PF_UC0_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM44_PF_UC0_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM44_PF_UC1_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM44_PF_UC1_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM44_PF_UC3_SCLK                     ((uint32_t)0X00000004)
#define IOMUX_PINCM44_PF_UC3_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM44_PF_TIMG7_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM44_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM44_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000007)

/* IOMUX_PINCM45[PF] Bits */
#define IOMUX_PINCM45_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM45_PF_GPIOA_DIO30                  ((uint32_t)0X00000001)
#define IOMUX_PINCM45_PF_UC3_CS0                      ((uint32_t)0X00000002)
#define IOMUX_PINCM45_PF_UC3_CTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM45_PF_UC0_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM45_PF_UC2_CS0                      ((uint32_t)0X00000004)
#define IOMUX_PINCM45_PF_TIMG6_CCP0                   ((uint32_t)0X00000005)


#if   defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/*@}*/ /* end of group MSPM0G511X_PeripheralDecl */

/*@}*/ /* end of group MSPM0G511X_Definitions */

#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_m0p_mspm0g511x__include */
